# Create Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PropertySetElement..::..Create Method
PropertySetElement Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, StructuralAsset) | Creates a new PropertySetElement to contain the given asset. |
| Create(Document, ThermalAsset) | Creates a new PropertySetElement to contain the given asset. |

# See Also
PropertySetElement Class
PropertySetElement Members
Autodesk.Revit.DB Namespace